app/controllers/books_controller.rb

SELECT "books".* FROM "books"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def index
  	@books = Book.all
  	@book = Book.new
    @user = User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "zzzzzzz"], ["body", "zzzzzzzz"], ["user_id", 4], ["created_at", "2020-04-06 08:12:37.380225"], ["updated_at", "2020-04-06 08:12:37.380225"]]
SELECT "books".* FROM "books"
---
  def create
  	@book = Book.new(book_params)
  	@book.user_id = current_user.id
    @user = User.find(current_user.id)
    if @book.save
      flash[:notice] = "You have creatad book successfully."
  	  redirect_to book_path(@book.id)
    else
      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @book = Book.new
    @book = Book.find(params[:id])